docs/faqs/deployment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-24 Tue 18:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>akvo-lument blue/green deployment</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="tangrammer" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">akvo-lument blue/green deployment</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org54f831c">1. why blue/green and not red/black?</a></li>
<li><a href="#orgaddc253">2. what does <code>blue/green</code> <code>B/G</code> deployment mean?</a></li>
<li><a href="#org1d4a899">3. how many <code>B/G</code> deployments do we have?</a></li>
<li><a href="#org18b4a6a">4. which are the <code>live/dark</code> urls?</a>
<ul>
<li><a href="#org0d94d91">4.1. In <code>test</code> environment:</a></li>
<li><a href="#orgb894b0a">4.2. In <code>prod</code> environment:</a></li>
</ul>
</li>
<li><a href="#org2bfba68">5. how do we deploy new changes to <code>dark</code> instances?</a></li>
<li><a href="#org2b80585">6. how do we change gcloud environment to production or test?</a></li>
<li><a href="#org011aa99">7. which is the current instance/color listening to <code>live</code> url?</a></li>
<li><a href="#org63154fe">8. how we can flip colors? flipping instances, passing dark to live</a></li>
<li><a href="#org5fe5e49">9. which akvo-lumen tenants are available in <code>dark</code> instances?</a></li>
<li><a href="#org080605e">10. how do we tag the release?</a></li>
<li><a href="#orgf41ab5a">11. how can we do github release?</a></li>
</ul>
</div>
</div>

<div id="outline-container-org54f831c" class="outline-2">
<h2 id="org54f831c"><span class="section-number-2">1</span> why blue/green and not red/black?</h2>
<div class="outline-text-2" id="text-1">
<p>
colors doesn't mean anything special, just identify 2 instances
So instead of blue/green this deployment patter could be called instance-1/instance-2   
</p>
</div>
</div>


<div id="outline-container-orgaddc253" class="outline-2">
<h2 id="orgaddc253"><span class="section-number-2">2</span> what does <code>blue/green</code> <code>B/G</code> deployment mean?</h2>
<div class="outline-text-2" id="text-2">
<p>
(explained to a 5 years old kid) this <code>B/G</code> pattern consists in having 2 instances running at the same time in the same environment but listening to differents <code>urls</code>. Both <code>urls</code> are reachable but only one is the URL known for the services or clients. Let's call these urls <code>live</code> and <code>dark</code> depending this property.
</p>

<p>
So we have 2 instances called <code>blue</code> and <code>green</code>, and 2 urls <code>live</code> and <code>dark</code>
</p>

<p>
Then at any time we'll have <code>live</code> url pointing to a <code>blue</code> or <code>green</code> instance and <code>dark</code> url pointing to the other
</p>

<p>
<code>dark</code> url and related instance is used to test new changes
<code>live</code> url and related instance is used for production real clients
</p>

<p>
As an example, let's say that <code>live</code> url is routed to <code>blue</code> instance, then the pattern to follow is pushing new changes to <code>green</code> instance that is reachable by <code>dark</code> url, and when we are sure that all changes are working fine then we change the routing to associate <code>live</code> url to <code>green</code> instance, being <code>blue</code> instance related to <code>dark</code> url 
</p>


<p>
<a href="https://www.martinfowler.com/bliki/BlueGreenDeployment.html">More info on B/G from Martin Fowler</a>
</p>
</div>
</div>


<div id="outline-container-org1d4a899" class="outline-2">
<h2 id="org1d4a899"><span class="section-number-2">3</span> how many <code>B/G</code> deployments do we have?</h2>
<div class="outline-text-2" id="text-3">
<p>
Currently akvo-lumen has 2 gcloud deployments <code>test</code> and <code>prod</code>, that represents 4 instances
</p>
</div>
</div>


<div id="outline-container-org18b4a6a" class="outline-2">
<h2 id="org18b4a6a"><span class="section-number-2">4</span> which are the <code>live/dark</code> urls?</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org0d94d91" class="outline-3">
<h3 id="org0d94d91"><span class="section-number-3">4.1</span> In <code>test</code> environment:</h3>
<div class="outline-text-3" id="text-4-1">
<p>
dark =&gt; <a href="https://dark-lumen.akvotest.org/">https://dark-lumen.akvotest.org/</a>
live =&gt; <a href="https://lumen.akvotest.org/">https://lumen.akvotest.org/</a>
</p>
</div>
</div>


<div id="outline-container-orgb894b0a" class="outline-3">
<h3 id="orgb894b0a"><span class="section-number-3">4.2</span> In <code>prod</code> environment:</h3>
<div class="outline-text-3" id="text-4-2">
<p>
dark =&gt; <a href="https://dark-demo.akvolumen.org/">https://dark-demo.akvolumen.org/</a> 
live =&gt; <a href="https://demo.akvolumen.org/">https://demo.akvolumen.org/</a>
</p>
</div>
</div>
</div>


<div id="outline-container-org2bfba68" class="outline-2">
<h2 id="org2bfba68"><span class="section-number-2">5</span> how do we deploy new changes to <code>dark</code> instances?</h2>
<div class="outline-text-2" id="text-5">
<p>
akvo-lumen ci build is configured to automatically deploy to dark instances the changes pushed to develop and master branchs.
</p>

<p>
Being <code>develop</code> branch associated to <code>test</code> environment and <code>master</code> branch to <code>prod</code> environment
</p>

<p>
So we only need to push changes to develop or master branchs to do related dark deployments
</p>
</div>
</div>


<div id="outline-container-org2b80585" class="outline-2">
<h2 id="org2b80585"><span class="section-number-2">6</span> how do we change gcloud environment to production or test?</h2>
<div class="outline-text-2" id="text-6">
<p>
<b>To change to production &#x2026;.</b>
</p>
<div class="org-src-container">
<pre class="src src-shell">gcloud container clusters get-credentials production --zone europe-west1-d --project akvo-lumen
</pre>
</div>

<p>
<b>To change to test &#x2026;.</b>
</p>
<div class="org-src-container">
<pre class="src src-shell">gcloud container clusters get-credentials test --zone europe-west1-d --project akvo-lumen
</pre>
</div>
</div>
</div>


<div id="outline-container-org011aa99" class="outline-2">
<h2 id="org011aa99"><span class="section-number-2">7</span> which is the current instance/color listening to <code>live</code> url?</h2>
<div class="outline-text-2" id="text-7">
<p>
<b>Firstly you need to read: how do we change gcloud environment to production or test?</b>
</p>

<p>
And then, there is a script to know which is the live color, that's to say, which instance is waiting in <code>live</code> url
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #006FE0;">cd</span> ci
./live-color.sh
</pre>
</div>

<pre class="example">
blue

</pre>
</div>
</div>


<div id="outline-container-org63154fe" class="outline-2">
<h2 id="org63154fe"><span class="section-number-2">8</span> how we can flip colors? flipping instances, passing dark to live</h2>
<div class="outline-text-2" id="text-8">
<p>
Execute following script, during the execution you'll need to choose which gcloud environment you want to flip (test or production)
</p>

<p>
<code>ci/flip-blue-green-deployment.sh</code>
</p>

<p>
Below an example of how logs will look like 
</p>

<div class="org-src-container">
<pre class="src src-shell">
$ ci/flip-blue-green-deployment.sh
Probably is either test or production: production
Are you sure you want to flip production? <span style="color: #707183;">[</span>yn<span style="color: #707183;">]</span> y
12:28:53 - INFO - running: gcloud container clusters get-credentials production --zone europe-west1-d --project akvo-lumen
Fetching cluster endpoint and auth data.
kubeconfig entry generated for production.
12:28:55 - INFO - Reading blue/green status of production
12:29:00 - INFO - Current LIVE is green
12:29:00 - INFO - Setting blue as LIVE
service <span style="color: #008000;">"lumen-live"</span> configured
service <span style="color: #008000;">"lumen-dark"</span> configured
service <span style="color: #008000;">"lumen-blue-green-gateway"</span> unchanged
12:29:02 - INFO - Switching k8s context back to gke_akvo-lumen_europe-west1-d_test
Switched to context <span style="color: #008000;">"gke_akvo-lumen_europe-west1-d_test"</span>.

</pre>
</div>
</div>
</div>


<div id="outline-container-org5fe5e49" class="outline-2">
<h2 id="org5fe5e49"><span class="section-number-2">9</span> which akvo-lumen tenants are available in <code>dark</code> instances?</h2>
<div class="outline-text-2" id="text-9">
<p>
So far, <code>dark-utz.akvolumen.org</code>, <code>dark-fmwrnigeria.akvolumen.org</code> and <code>dark-demo.akvolumen.org</code>.
Tenants available depends on KeyCloak Db
</p>
</div>
</div>


<div id="outline-container-org080605e" class="outline-2">
<h2 id="org080605e"><span class="section-number-2">10</span> how do we tag the release?</h2>
<div class="outline-text-2" id="text-10">
<p>
You'll need to <b>verify</b> the new tag so firstly add to github your GPG signature. Go to <a href="https://github.com/settings/keys">https://github.com/settings/keys</a> and follow these steps <a href="https://help.github.com/articles/generating-a-gpg-key/">https://help.github.com/articles/generating-a-gpg-key/</a>
</p>

<p>
The format of tags follows this pattern: <code>vX.Y.Z</code> 
<code>X</code> represents major version (relates to new api, breaking changes &#x2026;)
<code>Y</code> just increments in each release
<code>Z</code> means hot fix or patch
</p>

<p>
<b>Tags had to be anotated and signed</b>
</p>

<p>
<code>git tag -a -s v0.0.0</code>
</p>

<p>
Then you'll be promted to insert a message.
Insert following one, changing <code>X.Y.Z</code> with proper values
<code>Title: Akvo Lumen vX.Y.Z</code>
</p>

<p>
<b>Push new tag to origin/master</b>
</p>
</div>
</div>


<div id="outline-container-orgf41ab5a" class="outline-2">
<h2 id="orgf41ab5a"><span class="section-number-2">11</span> how can we do github release?</h2>
<div class="outline-text-2" id="text-11">
<p>
Go to <a href="https://github.com/akvo/akvo-lumen/tags">https://github.com/akvo/akvo-lumen/tags</a> and verify that tag is signed then <b>create a new github release</b>, clicking in "Add Release Notes" link
</p>

<p>
Here a finished example: <a href="https://github.com/akvo/akvo-lumen/releases/tag/v0.29.0">https://github.com/akvo/akvo-lumen/releases/tag/v0.29.0</a>
</p>

<p>
As you can see, you'll need to manually add each issue to a one of the following sections 
</p>
<ul class="org-ul">
<li>New and noteworthy</li>
<li>Bugfixes</li>
<li>Internal improvements</li>
</ul>

<p>
Below you have a script that queries commits between 2 tags v0.28.1 and v2.29.0.
</p>
<div class="org-src-container">
<pre class="src src-shell">git log --no-merges  v0.28.1..v0.29.0 | grep -E -o <span style="color: #008000;">'#[0-9]+'</span> | sort -u | grep -E -o <span style="color: #008000;">'[0-9]+'</span> &gt; /tmp/issues.txt &amp;&amp; <span style="color: #0000FF;">for</span> i<span style="color: #0000FF;"> in</span> $<span style="color: #707183;">(</span>cat /tmp/issues.txt<span style="color: #707183;">)</span>; <span style="color: #0000FF;">do </span><span style="color: #006FE0;">echo</span> <span style="color: #008000;">"https://github.com/akvo/akvo-lumen/issues/$i"</span>; <span style="color: #0000FF;">done</span>;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/1225">https://github.com/akvo/akvo-lumen/issues/1225</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/1401">https://github.com/akvo/akvo-lumen/issues/1401</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/1426">https://github.com/akvo/akvo-lumen/issues/1426</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/1435">https://github.com/akvo/akvo-lumen/issues/1435</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/1437">https://github.com/akvo/akvo-lumen/issues/1437</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/1442">https://github.com/akvo/akvo-lumen/issues/1442</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/1443">https://github.com/akvo/akvo-lumen/issues/1443</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/1494">https://github.com/akvo/akvo-lumen/issues/1494</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/1513">https://github.com/akvo/akvo-lumen/issues/1513</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/1514">https://github.com/akvo/akvo-lumen/issues/1514</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/1516">https://github.com/akvo/akvo-lumen/issues/1516</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/1519">https://github.com/akvo/akvo-lumen/issues/1519</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/1525">https://github.com/akvo/akvo-lumen/issues/1525</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/1534">https://github.com/akvo/akvo-lumen/issues/1534</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/1543">https://github.com/akvo/akvo-lumen/issues/1543</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/1549">https://github.com/akvo/akvo-lumen/issues/1549</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/1554">https://github.com/akvo/akvo-lumen/issues/1554</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/akvo/akvo-lumen/issues/778">https://github.com/akvo/akvo-lumen/issues/778</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: tangrammer</p>
<p class="date">Created: 2018-07-24 Tue 18:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
